<template>
  <article class="w-5/6 mx-auto py-8 text-text/90 max-w-4xl prose prose-h1:text-2xl prose-h1:text-center prose-headings:font-semibold">
    <h1>{{ TITLE }}</h1>
    <p>非常歡迎您瀏覽「婚禮邀請函 若筠&恩騰」（以下簡稱本網站）。為了讓您能夠安心使用本網站的服務與功能，特此說明本網站的隱私權保護政策，以保障您的個人資料及權益，請您詳閱以下內容：</p>

    <h2>一、隱私權保護政策的適用範圍</h2>
    <p>本政策適用於您在使用本網站服務時所收集的個人資料。不適用於外部連結網站或非本網站管理的人員。</p>

    <h2>二、個人資料的蒐集、處理及利用方式</h2>
    <p>當您瀏覽本網站或填寫婚禮表單時，可能會需要您提供姓名、聯絡方式等必要資訊，以便處理您的參與回覆或其他需求。提供的資料僅用於婚禮相關用途，絕不會用於其他目的或分享給第三方。</p>
    <p>婚禮表單中「對我們說的話」欄位所填寫的內容，若您選擇填寫，可能會經過簡單審核後，作為祝福留言公開於網站上。若您不希望留言被公開，請於留言中註明，我們將尊重您的意願。</p>

    <h2>三、資料之保護</h2>
    <p>本網站使用安全機制保護您的資料，包括防火牆和加密技術。僅限經授權人員存取您的個人資料，所有處理人員均遵守保密協議。如委託第三方協助處理，將嚴格要求其履行保密義務。</p>

    <h2>四、網站對外的相關連結</h2>
    <p>本網站可能包含其他網站的連結（例如地圖服務），但該連結網站的隱私政策將不適用於本網站。</p>

    <h2>五、與第三方共用個人資料之政策</h2>
    <p>本網站不會分享、交換、出租或出售您的個人資料。例外情況包括但不限於：</p>
    <ul>
      <li>經您的書面同意。</li>
      <li>法律明文規定。</li>
      <li>為確保您的安全或權益。</li>
    </ul>

    <h2>六、Cookie 的使用</h2>
    <p>為了提供更佳使用體驗，本網站可能使用 Cookie。若您不希望接受 Cookie，可調整瀏覽器設定，但可能影響部分功能的正常運作。</p>

    <h2>七、隱私權保護政策之修正</h2>
    <p>本網站保留隨時更新隱私權政策的權利，修正後的內容將公佈於網站上。</p>

    <h2>八、聯繫管道</h2>
    <p>如有任何疑問或需更正、移除您的個人資料，請透過以下方式聯繫我們：</p>
    <ul>
      <li>Email 至：<a href="mailto:contact@nosegates.com">contact@nosegates.com</a>.</li>
    </ul>
  </article>
  <p class=" text-center">
    <router-link to="/" class="underline"><i class='bx bx-home' />回首頁</router-link>
  </p>
</template>

<script setup>
const TITLE = `隱私權條款`
</script>


<route lang="json">{
  "meta": {
    "title": "隱私權條款"
  }
}</route>